const MIN_PHOTO_NUMBER = 1;
const MAX_PHOTO_NUMBER = 25;
const MIN_LIKES = 15;
const MAX_LIKES = 200;
const MAX_COMMENTS = 30;
const MIN_AVATAR_NUMBER = 1;
const MAX_AVATAR_NUMBER = 6;

const NAMES = [
  'Маша',
  'Вика',
  'Женя',
  'Света',
  'Гоша',
  'Саша',
  'Ксюша',
  'Паша',
  'Лида',
  'Сеня',
  'Коля',
  'Даша',
  'Оля',
  'Наташа',
  'Олег',
  'Люда',
  'Аня',
  'Ира',
  'Миша',
  'Митя',
  'Леша',
  'Рома',
  'Таня',
  'Степа',
  'Гриша',
];
const DESCRIPTIONS = [
  'Афганские дети впервые в своей жизни видят яблоко',
  'Мужчина пытается спасти несколько кошек из полностью затопленного дома',
  'Семьи беженцев из Латинской Америки нелегально пересекают границу США с Мексикой',
  'Полиция арестовывает группировку торговцев людьми в Мехико',
  'Обломки лодки, на которой 12 беженцев из Мавритании пытались добраться до Европы',
  'Немецкие экоактивисты протестуют против строительства угольной шахты',
  'Голод и нищета в Венесуэле',
  'Последствия урагана в Китае',
  'Гражданская война в Южной Африке',
  'Извержение вулкана в Исландии',
];
const MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!',
];

export {
  MIN_PHOTO_NUMBER,
  MAX_PHOTO_NUMBER,
  MIN_LIKES,
  MAX_LIKES,
  MAX_COMMENTS,
  MIN_AVATAR_NUMBER,
  MAX_AVATAR_NUMBER,
  NAMES,
  DESCRIPTIONS,
  MESSAGES,
};
